In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv(r'C:\Users\NIhar\Downloads\Indeed_after_cleaning.csv')

In [ ]:
len(df)

985

In [ ]:
df.head()

,Unnamed: 0,Unnamed: 1,Date,Company Name,Location,Job Title,Description,JOB,Location.1,State,Unnamed: 10
0,0,NaN,Posted3 days ago,Bosch Group,"Bengaluru, Karnataka",newData Scientist – AI / Deep Learning for Aut...,3.Most importantly – data aptitude.\n1.Looking...,Data Scientist,Bengaluru,Karnataka,NaN
1,1,NaN,Posted3 days ago,Standard Chartered,"Chennai, Tamil Nadu","newData Scientist, AIML",Manage a team dedicated for reviewing models r...,Data Scientist,Chennai,Tamil Nadu,NaN
2,2,NaN,PostedToday,Kaplan,"Bengaluru, Karnataka",newAssociate Data Scientist,Collaborate and help other data scientists.\nE...,Data Scientist,Bengaluru,Karnataka,NaN
3,3,NaN,Posted1 day ago,Corteva Agriscience,"Hyderabad, Telangana",newAssociate Data Scientist,Leverage data science and data engineering res...,Data Scientist,Hyderabad,Telangana,NaN
4,4,NaN,Posted14 days ago,UnitedHealth Group,"Bengaluru, Karnataka",Assc Data Scientist,4.Must have experience in working with end to ...,Data Scientist,Bengaluru,Karnataka,NaN

In [ ]:
df[df['Company Name']=='Bosch Group']

,Unnamed: 0,Unnamed: 1,Date,Company Name,Location,Job Title,Description,JOB,Location.1,State,Unnamed: 10
0,0,NaN,Posted3 days ago,Bosch Group,"Bengaluru, Karnataka",newData Scientist – AI / Deep Learning for Aut...,3.Most importantly – data aptitude.\n1.Looking...,Data Scientist,Bengaluru,Karnataka,NaN
65,65,NaN,Posted5 days ago,Bosch Group,"Bengaluru, Karnataka",newData Scientist,Able to understand various data structures and...,Data Scientist,Bengaluru,Karnataka,NaN
69,69,NaN,Posted30+ days ago,Bosch Group,"Bengaluru, Karnataka",Data Scientist / Sr. Data Scientist,Proven track record and experience with statis...,Data Scientist,Bengaluru,Karnataka,NaN
82,82,NaN,Posted5 days ago,Bosch Group,"Bengaluru, Karnataka",newData Scientist,Able to understand various data structures and...,Data Scientist,Bengaluru,Karnataka,NaN
94,94,NaN,Posted5 days ago,Bosch Group,"Bengaluru, Karnataka",newData Scientist for Battery Domain,Ø Passionate to solve engineering problems usi...,Data Scientist,Bengaluru,Karnataka,NaN
167,167,NaN,Posted30+ days ago,Bosch Group,"Bengaluru, Karnataka",BCAI - Data Scientist / Senior Data Scientist,"Mine and analyze data, applying statistical me...",Data Scientist,Bengaluru,Karnataka,NaN
186,186,NaN,Posted9 days ago,Bosch Group,"Bengaluru, Karnataka",Senior Data Scientist_EBM, Extensive experience as a data scientist.\n...,Data Scientist,Bengaluru,Karnataka,NaN

In [ ]:
dict1 = {'Company Name': df['Company Name'].unique()}
# df['Company Name'].unique()

In [ ]:
df1 = pd.DataFrame(dict1)

In [ ]:
df1.to_csv('company_name.csv')

In [ ]:
imp = ["NLP","nlp","ML",]

In [ ]:
for i in df.Description.loc[1].split():
    if i in imp:
        print(i)

ML

In [ ]:
df.Description = df.Description.str.replace(',','')

In [ ]:
df.Description = df.Description.str.replace('\n1','')

In [ ]:
df.Description = df.Description.str.replace('.\n','')

C:\Users\NIhar\AppData\Local\Temp/ipykernel_11440/1931597122.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df.Description = df.Description.str.replace('.\n','')

In [ ]:
df.Description = df.Description.str.replace('-','')

In [ ]:
python = []
for i in df.Description.str.split():
        if 'python' in i or 'Python' in i:
            python.append(1)
        else:
            python.append(0)

In [ ]:
NLP = []
for i in df.Description.str.split():
        if 'NLP' in i or 'nlp' in i:
            NLP.append(1)
        else:
            NLP.append(0)

In [ ]:
ML = []
for i in df.Description.str.split():
        if 'ML' in i or 'ml' in i or 'machine' in i:
            ML.append(1)
        else:
            ML.append(0)

In [ ]:
AI = []
for i in df.Description.str.split():
        if 'AI' in i or 'Ai' in i or 'Artificial intelligence' in i:
            AI.append(1)
        else:
            AI.append(0)

In [ ]:
DL = []
for i in df.Description.str.split():
        if 'DL' in i or 'DL' in i:
            DL.append(1)
        else:
            DL.append(0)

In [ ]:
SQL = []
for i in df.Description.str.split():
        if 'SQL' in i or 'SQL' in i:
            SQL.append(1)
        else:
            SQL.append(0)

In [ ]:
R = []
for i in df.Description.str.split():
        if 'R' in i or 'R' in i:
            R.append(1)
        else:
            R.append(0)

In [ ]:
Statistics = []
for i in df.Description.str.split():
        if 'Statistics' in i or 'Statistics' in i:
            Statistics.append(1)
        else:
            Statistics.append(0)

In [ ]:
degree = []
for i in df.Description.str.split():
        if 'Bachelor' in i or 'Master' in i:
            degree.append(1)
        else:
            degree.append(0)

In [ ]:
len(ML)

985

In [ ]:
sum(ML)

113

In [ ]:
df["Python"] = python
df["NLP"] = NLP
df["ML"] = ML
df['Artificial Inteligence'] = AI
df['DL'] = DL
df['SQL'] = SQL
df['R language'] = R
df['Statistics'] = Statistics

In [ ]:
df.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Date', 'Company Name', 'Location',
       'Job Title', 'Description', 'JOB', 'Location.1', 'State', 'Unnamed: 10',
       'Python', 'NLP', 'ML', 'Artificial Inteligence', 'DL', 'SQL',
       'R language', 'Statistics'],
      dtype='object')

In [ ]:
df = df.drop(['Unnamed: 0', 'Unnamed: 1','Unnamed: 10'],axis = 1)

In [ ]:
df.columns

Index(['Date', 'Company Name', 'Location', 'Job Title', 'Description', 'JOB',
       'Location.1', 'State', 'Python', 'NLP', 'ML', 'Artificial Inteligence',
       'DL', 'SQL', 'R language', 'Statistics'],
      dtype='object')

In [ ]:
df.to_csv('cleaning.csv')

In [ ]:
data = pd.read_csv(r"C:\Users\NIhar\Downloads\clean004.csv")

In [ ]:
data.head()

,Company Name,Location,Job Title,Description,JOB,Location.1,State,Python,SQL,R language,Linux,0,Cloud
0,Bosch Group,"Bengaluru, Karnataka",newData Scientist – AI / Deep Learning for Aut...,3.Most importantly – data aptitude..Looking at...,Data Scientist,Bengaluru,Karnataka,0,0,0,0,0,AWS
1,Standard Chartered,"Chennai, Tamil Nadu","newData Scientist, AIML",Manage a team dedicated for reviewing models r...,Data Scientist,Chennai,Tamil Nadu,1,0,0,1,0,AWS
2,Kaplan,"Bengaluru, Karnataka",newAssociate Data Scientist,Collaborate and help other data scientistsExtr...,Data Scientist,Bengaluru,Karnataka,1,0,0,0,0,AWS
3,Corteva Agriscience,"Hyderabad, Telangana",newAssociate Data Scientist,Leverage data science and data engineering res...,Data Scientist,Hyderabad,Telangana,1,0,0,1,0,AWS
4,UnitedHealth Group,"Bengaluru, Karnataka",Assc Data Scientist,4.Must have experience in working with end to ...,Data Scientist,Bengaluru,Karnataka,1,0,0,0,0,AWS

In [ ]:
data.Cloud.unique()

array(['AWS', 'Azure', 'Both or Didnt Specift'], dtype=object)

In [ ]:
data1 = pd.read_csv(r"C:\Users\NIhar\Downloads\Untitled spreadsheet - Sheet1.csv")

In [ ]:
data1.head()

          Company Name    Revenue No of employee
0          Bosch Group  $77.721 B          31000
1   Standard Chartered  $14.701 B          85000
2               Kaplan     $1.3 B          12000
3  Corteva Agriscience  $14.271 B          21000
4   UnitedHealth Group   $285.1 B         300000

In [ ]:
data1.isnull().sum()

Company Name        0
Revenue           123
No of employee    118
dtype: int64

In [ ]:
data1['Revenue'] = data1["Revenue"].fillna('0.0005')
data1['No of employee'] = data1['No of employee'].fillna(20)

In [ ]:
data1.isnull().sum()

Company Name      0
Revenue           0
No of employee    0
dtype: int64

In [ ]:
d = {}
for i in range(len(data1['Company Name'])):
    
        d[data1['Company Name'][i]] = data1["Revenue"][i]
print(d)

{'Bosch Group': '$77.721 B', 'Standard Chartered': '$14.701 B', 'Kaplan': '$1.3 B', 'Corteva Agriscience': '$14.271 B', 'UnitedHealth Group': '$285.1 B', 'HP': '$56.64 B', 'Deloitte': '$50.2 B', 'JPMorgan Chase Bank, N.A.': '$119.54 B', '3SC Solutions': '$0.055 B', 'Orange Business Services': '$8.41 B', 'Maersk': '$39 B', 'Jumio Corporation': '0.0005', 'Expleo': '$1.5 B', 'Microland': '$7.62 B', 'Onward Group': '$0.03 B', 'Smiths Detection': '$2.793 B', 'DBS Bank': '$10.28 B', 'Indium Software': '$0.0773 B', 'Narayana Health': '$0.42 B', 'citius tech': '$0.2 B', 'AIBridge ML': '$0.05 B', 'Confluent': '$338.3 B', 'MasterCard': '$18.88 B', 'Qualfon': '$0.4 B', 'Kyndryl': '$18.6 B', 'Ecolab': '$14.9 B', 'Unilever': '$52.444 B', 'Hewlett Packard Enterprise': '$2 B', 'Global Industrial': '$1.26 B', 'EY': '$40 B', 'Sutherland': '$1.1B', 'Oracle': '$40.47 B', 'Societe Generale': '$6.44 B', 'dunnhumby': '$0.444 B', 'Coinbase': '$1.14 B', 'Visa': '$21.85 B', 'HDFC Life': '$0.22 B', 'Bolt': '$0.221 B', 'umlaut AG': '$0.476 B', 'Fractal.ai': '$0.1 B', 'Tredence': '$0.0302 B', 'Casepoint Pvt. Ltd.': '$0.1909 B', 'Honeywell': '$32.392 B', 'Intel': '$79.02 B', 'Cliksource': '$ 0.5 B', 'Jacobs': '$ 13,47 B', 'Cummins Inc.': '$ 23.571 B', 'CGI Inc': '$ 12.16 B', 'Philips': '$ 22.19 B', 'SAP': '$ 0.030859 B', 'CityLink Technology Solutions': '$ 0.005 B', 'BNY Mellon': '$ 20.82 B', 'Sofar Ocean': '$ 0.002 B', 'Walmart Global Tech India': '$ 40.65 B', 'Oportun Inc': '$ 0.583 B', 'Crowe': '$ 44 B', 'Cygnet Infotech': '$0.1521B', 'Uber': '$ 1.13 B', 'Vistex Asia-Pacific Private Ltd.': '$ 0.250 B', 'Signify': '$2.008 B', 'NatWest Group': '$ 4.14 B', 'Apple': '$ 365.82 B', 'Amex': '$ 36.09 B', 'Beinex': '$ 0.018 B', 'Kwalee': '$ 0.0283 B', 'Mercedes-Benz Group AG': '$ 1600 B', 'MABZONE IT SOLUTIONS': '$ 0.005 B', 'Paktolus': '$ 0.044 B', 'Ford Global Business Services': '$ 127 B', 'GE Aviation': '$ 74.19 B', 'Shell': '$ 26.150 B', 'Lam Research': '$ 4.2266 B', 'IBM': '$5.735 B', 'The Luxury Closet': '$0.009 B', 'Microsoft': '$ 168 B', 'Postman': '$ 0.815 B', 'Vodafone': '$ 50.011 B', 'Boston Consulting Group': '$ 8.60 B', 'RedSeer Management Consulting': '$ 0.006 B', 'Brose': '$ 1.89 B', 'Maruti Suzuki India Ltd': '$ 10 B', 'BD': '$ 17.117 B', 'Canum Infotech': '$ 0.0005 B', 'thyssenkrupp India Pvt. Ltd.': '$ 32.384 B', 'Cyient': '$0.570 B', 'Snowflake': '$0.592 B', 'Agoda Company': '$ 1.5 B', 'ExxonMobil': '$181.502 B', 'Morgan Stanley': '$14.5 B', 'Alstom': '$ 5.11 B', 'GSK': '$ 11.644 B', 'Delhivery': '$0.075 B', 'Open Insights': '0.0005', 'Netradyne': '$ 13.47 B', 'Atlassian': '$ 23.571 B', 'IHS Markit': '$ 12.16 B', 'Klevu Oy': '$ 22.19 B', 'Airtel India': '$ 30.859 B', 'PubMatic': '$ 0.005 B', 'Blackbuck': '$ 20.82 B', 'Infosys Limited': '$ 14 B', 'Tekion': '$ 0.576 B', 'mPokket': '$ 0.013 B', 'Michelin': '$ 26.015 B', 'Amazon Dev Center India - Hyd': '$5 B', 'GO-JEK': '$0.086 B', 'Autodesk': '$3.79 B', 'HGS': '$0.753 B', 'Ignitarium Technology Solutions': '$0.0536 B', 'Elsevier': '$3.95 B', 'S&P Global': '$6.036 B', 'Blinkit': '$0.3 B', 'McAfee Enterprise': '$2.906 B', 'Surya Systems': '$0.008 B', 'Assurant': '$10.094 B', 'Ayla Networks': '$0.021 B', 'Qualys': '$0.363 B', 'Clariant': '$6.623 B', 'QuestAlliance': '$0.007 B', 'Siemens': '$70.67 B', 'Exapas': '0.0005', 'Medtronic': '$30.117 B', 'ArrayGen Technologies': '$0.005 B', 'ADCI - Karnataka': '0.0005', 'Dell Technologies': '$94.24 B', 'Micron': '$21.44 B', 'Tesco': '$78.80 B', 'GD Research Center': '$0.153 B', 'NTT DATA': '$20.12 B', 'ZF': '$41.45 B', 'Syneos Health Clinical': '$4.676 B', 'Bayer': '41.4 B', 'Kimberly-Clark': '0.0005', 'Spiceworks': '$0.05B', 'Texas Instruments': '0.0005', 'Myntra.com': '$17.19B', 'Collins Aerospace': '$6.83B', 'iSOCRATES': '$0.013B', 'Aptus Data LAbs': '$0.023B', 'Cashify': '$0.015B', 'Niramai': '$0.0226B', 'WHITE FORCE OUTSOURCING SERVICES PRIVATE LIMITED': '0.0005', 'Mobiquity': '$0.07B', 'Siemens Technology and Services Private Limited': '0.0005', 'Impiger Technologies': '0.0005', 'AISPL - Karnataka': '0.0005', 'PayPal': '$25.37B', 'Schneider Electric': '0.0005', 'Accenture': '$44B', 'Ola Cabs': '$0.34B', 'Great Learning': '$0.043B', 'Wells Fargo': '0.0005', 'Acuity Knowledge Partners': '0.0005', 'IQVIA': '$3.298B', 'RealPage': '$1.16B', 'Dun & Bradstreet': '0.0005', 'HERE Technologies': '0.0005', 'Coursera': '$0.2935B', 'State Street': '$11.7B', 'Harman International': '0.0005', 'WishFin': '$0.0464B', 'NEC Opportunities': '0.0005', 'Institutional Shareholder Services': '0.0005', 'Expedia Group': '0.0005', 'BOEING': '0.0005', 'Lingaro Group': '0.0005', 'GE Digital': '0.0005', 'Paytm': '$0.14B', 'Pfizer': '$41.9B', 'LeadSquared': '0.0005', 'Inspirion Digital Solutions': '0.0005', 'GE Healthcare': '0.0005', 'Concentrix': '0.0005', 'RELX': '0.0005', 'Salesforce': '0.0005', 'Elpis IT Solutions': '0.0005', 'Tala': '0.0005', 'Eclerx': '0.0005', 'Fundnel Pte Ltd': '0.0005', 'Careator Technologies': '0.0005', 'Deal4loans': '0.0005', 'AstraZeneca': '0.0005', 'VM3 Tech Solutions': '0.0005', 'TeamPlus Staffing Solution Pvt Ltd': '0.0005', 'HR Inc Consultants': '0.0005', 'QSSOT Technology': '0.0005', 'Transorg Analytics': '0.0005', 'Baker Hughes': '0.0005', 'IHCC': '0.0005', 'GenieTalk': '0.0005', 'Nihilent': '0.0005', 'Zscaler': '0.0005', 'MobiKwik': '0.0005', 'Technovert': '0.0005', 'Toluna': '0.0005', 'SoulPage IT Solutions': '0.0005', 'Rockwell Automation': '0.0005', 'Apptio': '0.0005', 'Acesoft Labs': '0.0005', 'UBS': '0.0005', 'Dexlock': '0.0005', 'Ninjacart': '0.0005', 'PAGO Analytics': '0.0005', 'Ameriprise Financial': '0.0005', 'ADCI HYD 13 SEZ': '0.0005', 'Danaher Digital': '0.0005', 'Henkel': '0.0005', 'Sanofi': '0.0005', 'Groupon': '0.0005', 'NielsenIQ': '0.0005', 'Ormae': '0.0005', 'XenonStack': '0.0005', 'Citi': '0.0005', 'Aspire Systems': '0.0005', 'ALTIMETRIK Inc': '0.0005', 'Country Veggie': '0.0005', 'Travel Centric Technology': '0.0005', 'iCliniq': '0.0005', 'Scienaptic Systems': '0.0005', 'Affine': '0.0005', 'PwC': '0.0005', 'Cargill': '0.0005', 'AppsTek Corp': '0.0005', 'Verizon': '0.0005', 'Atlas Copco (India) Ltd.': '0.0005', 'Nissan': '0.0005', 'VMock Inc': '0.0005', 'StratLytics': '0.0005', 'SearchUrCollege': '0.0005', 'Entytle': '0.0005', 'TomTom': '$0.759B', 'ITOrizon': '$0.021B', 'Tokopedia': '$28.6B', 'BMC Software': '$2B', 'Imurgence': '0.0005', 'Swiggy': '$0.37B', 'ZL Technologies': '0.0005', 'Kpler': '$0.036B', 'PhonePe': '$6.9B', 'Mount Talent Consulting': '0.0005', 'Adobe': '$12.86B', 'Goldman Sachs': '$44.6B', 'Merkle': '$1B', '2COMs': '0.0005', 'Medline Industries': '0.0005', 'Hitachi Vantara Corporation': '0.0005', 'Codelogicx Technologies Private Limited': '0.0005', 'Vodafone Idea': '0.0005', 'CustomerXPs': '0.0005', 'ValueLabs': '$0.9189B', 'Novartis': '$49.89B', 'StatusNeo Technology Consulting': '0.0005', 'Gridlogic': '0.0005', 'Intuit': '$9.633B', 'Kanini Software Solutions': '0.0005', 'Indian Institute of Digital Education': '0.0005', 'Credit Suisse': '0.0005', 'Innoplexus': '0.0005', 'Crimson Interactive': '0.0005', 'PREZENTIUM': '0.0005', 'Colgate-Palmolive': '$15.693B', 'Couche-Tard': '$45.76B', 'CTD Techs': '0.0005', 'Yara': '$14.44B', 'Claim Genius Making touchless claims a reality': '0.0005', 'Sybrant Data': '$0.024B', 'ABB': '$28.9B', 'Ericsson': '0.0005', 'Blue Yonder': '0.0005', '[24]7.ai': '0.0005', 'Sony India Software Centre Pvt Ltd': '0.0005', 'Hella': '$7B', 'VMware': '$11.78B', 'HDFC Bank': '$16B', 'Khoros': '$0.2B', 'mediaagility': '0.0005', 'Spotflock': '0.0005', 'Bain & Company': '0.0005', 'KPIT Technologies GmbH': '$0.291 B', 'Impact Guru': '0.0005', 'Crypto Mize': '$0.002 B', 'Dunzo': '$0.137 B', 'Unisys': '$2 B', 'AT&T': '$168 B', 'Innefu Labs Pvt. Ltd.': '$0.003 B', 'EVC Ventures': '0.062 B', 'West Pharmaceutical Services': '$2 B', 'The Neotia University': '0.0005', 'Wavemaker': '$2 B', 'CareerXperts': '$0.0035 B', 'Pivotchain Solution Technologies': '$0.0025 B', 'Aspire HR Solutions': '$0.015 B', 'Information Services Group': '$0.265 B', 'DeepQuanty Artificial Intelligence Labs': '$0.003 B', 'iGloble Solutions': '$0.004 B', 'The Walt Disney Company (Corporate)': '$67.418 B', 'TARGET': '$99.6 B', 'Kovai.co': '$0.001 B', 'Google': '$256.74 B', 'Innominds Software': '$ 0.005 B', 'Krea University': '$0.018 B', 'LatentBridge': '$ 0.0005 B', 'Logitech': '$5.252 B', 'BDB': '$0.0086 B', 'GLOINNT': '$0.0226 B', 'Wise Monk': '$0.06 B', 'Techvantage Systems': '$0.015 B', 'ZS': '$2 B', 'Bid Ocean': '$0.05 B', 'Truedge Software Solutions': '$ 0.5 B', 'Grid Logic Software Private Limited': '$0.0045 B', 'PharmaACE': '$0.071 B', 'Joveo': '$0.020 B', 'Cybage': '$1 B', 'Fidelity Investments': '$21 B', 'Emerson': '$18 B', 'Credit Saison': '$0.414 B', 'Upstox': '$0.4568 B', 'RedLotus': '$0.0039 B', 'General Mills': '$18 B', 'Ryan, LLC': '$0.446 B', 'Radware': '$0.25 B', 'Shivark': '0.0005', 'FIS Global': '$12 B', 'Samyak Infotech': '$0.022 B', 'Zauba Corp': '0.0005', 'Technovatrix': '0.0005', 'Aligned Automation': '$0.024 B', 'Linkites': '$0.02 B', '2basetechnologies': '$0.012 B', 'ADCI PNQ 13 SEZ': '0.0005', 'Eli Lilly': '$27 B', 'Exeliq Consulting': '$0.004 B', 'PepsiCo': '$70.37 B', 'AWS ProServe IN - Karnataka': '0.0005', 'Aruba Networks': '$3 B', 'ZunRoof Tech': '$0.007 B', 'ERM Group': '$1 B', 'Genpact': '$3.70 B', 'Thomson Reuters': '$6 B', 'Techlive': '$0.007 B', 'Carlson Wagonlit Travel': '$1.5 B ', 'Monotype': '$0.126 B', 'Knight FinTech': '$0.017 B', 'Prompt Softech': '$0.024 B', 'GE Renewable Energy': '$10.3 B', 'FactSet Research Systems': '$1.49 B', 'Trane Technologies': '$12.454 B', 'EDGE Networks': '$0.0158 B', 'Augusta Infotech': '$0.005 B', 'OptiSol': '$0.026 B', 'Tavant Technologies': '$0.223 B', 'ITH Technologies': '0.0005', 'Affinity Express': '$0.012 B', 'Icertis': '$ 0.165 B', 'Zebra Technologies': '$4.448 B', 'CRED': '$0.000069 B', 'Applogic': '$0.005 B', 'Mercedes-Benz Research and Development India...': '$0.739 B', 'Tookitaki': '$0.013 B', 'Supro info Solution': '$0.005 B', 'Aditya Birla Group': '$46 B', 'SMEcorner': '$0.03 B', 'CDM Smith': '$0.952 B', 'xtLytics': '$0.007 B', 'Siemens Healthineers India LLP': '16.41 B', 'Zippin': '$0.0052 B', 'NOVIQUE HEALTH': '$0.005 B', 'NeenOpal': '$0.00161 B', 'WSD Consultant': '$0.005 B', 'HSBC': '$50.429 B', 'Caterpillar': '$41.74 B', 'Axslogic': '$0.005 B', 'ServiceNow': '$4.51 B', 'Perfios': '$0.0369 B', 'TheMathCompany': '$0.0206 B', 'Alpha ICT LLP': '$0.005 B', 'Happymonk Technology': '$ 0.0005 B', 'Randstad': '$27.02 B', 'TIGI HR SOLUTION': '$0.005 B', 'Deutsche Bank': '$113.49 B', 'Weatherford': '$3.685 B', 'Helius Technologies': '$0.26 B', 'D Cube Analytics': '$0.034 B', 'BigTapp': '$0.005 B', 'Prevalent AI': '$0.05 B', 'NSEIT': '$ 0.5 B', 'GlobalLogic': '$0.850 B', 'MSCI Inc': '$1.69 B', 'Infosenseglobal': '0.0005 B', 'FinAcPlus': '$0.0175 B', 'RGF Professional Recruitment': '$0.02 B', 'Radware Bot Manager': '$0.216 B', 'IDfy': '$0.083 B', 'Turbolab Technologies': '$0.0078 B', 'Sequretek': '$0.034 B', 'HighRadius': '$0.25 B', 'Ruby Seven Studios': '$0.023 B', 'KlearNow': '$0.0112 B', 'Talentica Software India': '$0.35 B', 'Wolters Kluwer': '$5.22 B', 'ASSPL - Karnataka': '$ 0.0005 B', 'IQLECT': '$ 0.0005 B', 'Seagate Technology': '10.68 B', 'Oi': '$61B', "Assassin's Creed": '$1B', 'Vymo': '$0.0291B', 'Talent Leads HR Solutions': '0.0005', 'OakNorth Bank': '$0.0772B', 'The Smart Cube': '$0.02B', 'Buckman': '$0.816B', 'Near': '$0.0226B', 'Navit Software Solutions': '$ 0.0005 B', 'Payoda': '$0.315B', 'Tekolutions.ai': '0.0005', 'Protocolzone': '0.0005', 'Siemens Healthineers': '$ 14.46 B', 'Bajaj FinServ': '$7.2B', 'Infognana IG Solution': '$0.63 B', 'Alliance Recruitment Agency': '0.0005', 'PNR Software Solutions': '$0.023B', 'Mojocare, Alpha Digital Health': '0.0005', 'Juniper Networks': '$5B', 'AutomationEdge': '$0.0313B', 'Indicia Worldwide': '0.0005', 'BluePi Consulting Pvt Ltd.': '$ 0.016 B', 'Cardinal Health': '$162.47B', 'Amrita University': '$0.196B', 'Business Brio': '$0.0005 B', 'Anlage Infotech': '$0.02B', 'Commvault': '$0.7235B', 'Emerging India Group': '$ 0.0005 B', 'ARi': '$0.908B', 'Appriffy-Digital IT Hub': '$ 0.005 B', 'VN SoftSol': '$ 0.0005 B', 'Foghorn Systems': '$0.0133B', 'e-con Systems': '$0.025B', 'QuEST Global Engineering': '$ 0.05 B', 'UiPath': '$0.209B', 'Danfoss': '$ 7 B', 'GridEdge Technologies': '$ 0.0005 B', 'EATON': '$17.86B', 'Mind Works Global': '$0.017B', 'Squalas': '$0.00005 B', 'scaleorg': '$0.005 B', 'Michael Page': '$2B', 'ViaSat': '$2.30000000000003B', 'Aera Technology': '$0.0655B', 'Pype': '$0.0138B', 'itForte': '$0.005 B ', 'Carrier': '$17.46B', 'Germane Analytics Pvt Ltd': '$0.005 B', 'XoriantË\x90IN': '$0.25 B', 'DTCC': '$1.7844B', 'Talent Corner HR Services Pvt. Ltd.': '$0.014 B', 'Labcorp': '$13.9784B', 'Sigmoid, Bengaluru': '$0.049 B', 'Pathfinder Business Analysis': '$0.062B', 'Camsdata': '$0.005B', 'MNF MyNextFilm': '0.0015 B', 'M&G plc': '$ 0.518 B', 'Wissen Technology': '$0.0605 B', 'CrossML': '$0.1108 B', 'CoreStack': '0.01639 B', 'Accrete.AI': '$0.011 B', 'GE Corporate': '$74.196 B', 'KPMG': '$14.3B', 'iMerit': '$ 0.0235 B', 'Jubna': '$0.016 B'}

In [ ]:
e = {}
for i in range(len(data1['Company Name'])):
    
        e[data1['Company Name'][i]] = data1["No of employee"][i]
print(e)

{'Bosch Group': '31000', 'Standard Chartered': '85000', 'Kaplan': '12000', 'Corteva Agriscience': '21000', 'UnitedHealth Group': '300000', 'HP': '53000', 'Deloitte': '334800', 'JPMorgan Chase Bank, N.A.': '256105', '3SC Solutions': '221', 'Orange Business Services': '21000', 'Maersk': '83000', 'Jumio Corporation': '1085', 'Expleo': '15000', 'Microland': '4500', 'Onward Group': '2700', 'Smiths Detection': '14600', 'DBS Bank': '24174', 'Indium Software': '2000', 'Narayana Health': '11261', 'citius tech': '600', 'AIBridge ML': '30', 'Confluent': '1473', 'MasterCard': '24000', 'Qualfon': '16000', 'Kyndryl': '90000', 'Ecolab': '50000', 'Unilever': '149000', 'Hewlett Packard Enterprise': '59400', 'Global Industrial': '27', 'EY': '312250', 'Sutherland': '28856', 'Oracle': '132000', 'Societe Generale': '146000', 'dunnhumby': '3124', 'Coinbase': '1249', 'Visa': '20500', 'HDFC Life': '16544', 'Bolt': '3818', 'umlaut AG': '4500', 'Fractal.ai': '2500', 'Tredence': '1050', 'Casepoint Pvt. Ltd.': '635', 'Honeywell': '103000', 'Intel': '121100', 'Cliksource': '111', 'Jacobs': '55000', 'Cummins Inc.': '57,825', 'CGI Inc': '76,000', 'Philips': '21,483', 'SAP': '1,07,415', 'CityLink Technology Solutions': '25', 'BNY Mellon': '48,400', 'Sofar Ocean': '27', 'Walmart Global Tech India': '10,000', 'Oportun Inc': '1,474', 'Crowe': '4,440', 'Cygnet Infotech': '1,000', 'Uber': '22,800', 'Vistex Asia-Pacific Private Ltd.': '1,500', 'Signify': '37,000', 'NatWest Group': '59,900', 'Apple': '1,54,000', 'Amex': '63,700', 'Beinex': '30', 'Kwalee': '183', 'Mercedes-Benz Group AG': '1,73,000', 'MABZONE IT SOLUTIONS': '25', 'Paktolus': '43', 'Ford Global Business Services': '14,000', 'GE Aviation': '48,000', 'Shell': '86,000', 'Lam Research': '14,100', 'IBM': '2,70,000', 'The Luxury Closet': '193', 'Microsoft': '1,82,268', 'Postman': '858', 'Vodafone': '93,000', 'Boston Consulting Group': '21,000', 'RedSeer Management Consulting': '139', 'Brose': '25,000', 'Maruti Suzuki India Ltd': '19,945', 'BD': '76', 'Canum Infotech': '25', 'thyssenkrupp India Pvt. Ltd.': '1,03,598', 'Cyient': '10,000', 'Snowflake': '2,495', 'Agoda Company': '4,000', 'ExxonMobil': '72,000', 'Morgan Stanley': '60,000', 'Alstom': '75,000', 'GSK': '94,000', 'Delhivery': '66,000', 'Open Insights': 20, 'Netradyne': '55969', 'Atlassian': '56,261', 'IHS Markit': '56,553', 'Klevu Oy': '56,844', 'Airtel India': '57,136', 'PubMatic': '57427.22', 'Blackbuck': '57,719', 'Infosys Limited': '260000', 'Tekion': '1304', 'mPokket': '1400', 'Michelin': '127000', 'Amazon Dev Center India - Hyd': '15000', 'GO-JEK': '563', 'Autodesk': '11500', 'HGS': '41110', 'Ignitarium Technology Solutions': '289', 'Elsevier': '8600', 'S&P Global': '22500', 'Blinkit': '2000', 'McAfee Enterprise': '6900', 'Surya Systems': '45', 'Assurant': '14250', 'Ayla Networks': '142', 'Qualys': '1500', 'Clariant': '17901', 'QuestAlliance': '120', 'Siemens': '303000', 'Exapas': 20, 'Medtronic': '104950', 'ArrayGen Technologies': '25', 'ADCI - Karnataka': 20, 'Dell Technologies': '158000', 'Micron': '40000', 'Tesco': '367321', 'GD Research Center': '805', 'NTT DATA': '139500', 'ZF': '147797', 'Syneos Health Clinical': '23000', 'Bayer': '26000', 'Kimberly-Clark': 20, 'Spiceworks': '500', 'Texas Instruments': 20, 'Myntra.com': '1614', 'Collins Aerospace': '5000', 'iSOCRATES': '52', 'Aptus Data LAbs': '123', 'Cashify': '685', 'Niramai': '60', 'WHITE FORCE OUTSOURCING SERVICES PRIVATE LIMITED': 20, 'Mobiquity': '650', 'Siemens Technology and Services Private Limited': 20, 'Impiger Technologies': 20, 'AISPL - Karnataka': 20, 'PayPal': '26500', 'Schneider Electric': 20, 'Accenture': '150000', 'Ola Cabs': '3000', 'Great Learning': '2007', 'Wells Fargo': 20, 'Acuity Knowledge Partners': 20, 'IQVIA': '77000', 'RealPage': '10000', 'Dun & Bradstreet': 20, 'HERE Technologies': 20, 'Coursera': '1792', 'State Street': '5000', 'Harman International': 20, 'WishFin': '140', 'NEC Opportunities': 20, 'Institutional Shareholder Services': 20, 'Expedia Group': 20, 'BOEING': 20, 'Lingaro Group': 20, 'GE Digital': 20, 'Paytm': '11500', 'Pfizer': '78500', 'LeadSquared': 20, 'Inspirion Digital Solutions': 20, 'GE Healthcare': 20, 'Concentrix': 20, 'RELX': 20, 'Salesforce': 20, 'Elpis IT Solutions': 20, 'Tala': 20, 'Eclerx': 20, 'Fundnel Pte Ltd': 20, 'Careator Technologies': 20, 'Deal4loans': 20, 'AstraZeneca': 20, 'VM3 Tech Solutions': 20, 'TeamPlus Staffing Solution Pvt Ltd': 20, 'HR Inc Consultants': 20, 'QSSOT Technology': 20, 'Transorg Analytics': 20, 'Baker Hughes': 20, 'IHCC': 20, 'GenieTalk': 20, 'Nihilent': 20, 'Zscaler': 20, 'MobiKwik': 20, 'Technovert': 20, 'Toluna': 20, 'SoulPage IT Solutions': 20, 'Rockwell Automation': 20, 'Apptio': 20, 'Acesoft Labs': 20, 'UBS': 20, 'Dexlock': 20, 'Ninjacart': 20, 'PAGO Analytics': 20, 'Ameriprise Financial': 20, 'ADCI HYD 13 SEZ': 20, 'Danaher Digital': 20, 'Henkel': 20, 'Sanofi': 20, 'Groupon': 20, 'NielsenIQ': 20, 'Ormae': 20, 'XenonStack': 20, 'Citi': 20, 'Aspire Systems': 20, 'ALTIMETRIK Inc': 20, 'Country Veggie': 20, 'Travel Centric Technology': 20, 'iCliniq': 20, 'Scienaptic Systems': 20, 'Affine': 20, 'PwC': 20, 'Cargill': 20, 'AppsTek Corp': 20, 'Verizon': 20, 'Atlas Copco (India) Ltd.': 20, 'Nissan': 20, 'VMock Inc': 20, 'StratLytics': 20, 'SearchUrCollege': 20, 'Entytle': 20, 'TomTom': '4500', 'ITOrizon': '140', 'Tokopedia': '4700', 'BMC Software': '6000', 'Imurgence': 20, 'Swiggy': '11086', 'ZL Technologies': 20, 'Kpler': '150', 'PhonePe': '2500', 'Mount Talent Consulting': 20, 'Adobe': '11847', 'Goldman Sachs': '40500', 'Merkle': '14000', '2COMs': 20, 'Medline Industries': 20, 'Hitachi Vantara Corporation': 20, 'Codelogicx Technologies Private Limited': 20, 'Vodafone Idea': '13520', 'CustomerXPs': 20, 'ValueLabs': '5222', 'Novartis': '104323', 'StatusNeo Technology Consulting': 20, 'Gridlogic': '200', 'Intuit': '10600', 'Kanini Software Solutions': 20, 'Indian Institute of Digital Education': 20, 'Credit Suisse': 20, 'Innoplexus': 20, 'Crimson Interactive': 20, 'PREZENTIUM': 20, 'Colgate-Palmolive': '1130', 'Couche-Tard': '124000', 'CTD Techs': 20, 'Yara': '17000', 'Claim Genius Making touchless claims a reality': 20, 'Sybrant Data': '264', 'ABB': '105000', 'Ericsson': 20, 'Blue Yonder': 20, '[24]7.ai': 20, 'Sony India Software Centre Pvt Ltd': 20, 'Hella': '36000', 'VMware': '34000', 'HDFC Bank': '120093', 'Khoros': '1000', 'mediaagility': 20, 'Spotflock': 20, 'Bain & Company': 20, 'KPIT Technologies GmbH': '7125', 'Impact Guru': '68', 'Crypto Mize': '22', 'Dunzo': '669', 'Unisys': '17200', 'AT&T': '230000', 'Innefu Labs Pvt. Ltd.': '23', 'EVC Ventures': '293', 'West Pharmaceutical Services': '9200', 'The Neotia University': '94', 'Wavemaker': '7200', 'CareerXperts': '23', 'Pivotchain Solution Technologies': '24', 'Aspire HR Solutions': '90', 'Information Services Group': '1287', 'DeepQuanty Artificial Intelligence Labs': '21', 'iGloble Solutions': '22', 'The Walt Disney Company (Corporate)': '223000', 'TARGET': '40900', 'Kovai.co': '147', 'Google': '139995', 'Innominds Software': '50', 'Krea University': '140', 'LatentBridge': '25', 'Logitech': '9000', 'BDB': '80', 'GLOINNT': '70', 'Wise Monk': '40', 'Techvantage Systems': '35', 'ZS': '10000', 'Bid Ocean': '20', 'Truedge Software Solutions': '300', 'Grid Logic Software Private Limited': '25', 'PharmaACE': '325', 'Joveo': '100', 'Cybage': '6300', 'Fidelity Investments': '52000', 'Emerson': '86700', 'Credit Saison': '3575', 'Upstox': '2285', 'RedLotus': '21', 'General Mills': '33600', 'Ryan, LLC': '3000', 'Radware': '1122', 'Shivark': 20, 'FIS Global': '63000', 'Samyak Infotech': '118', 'Zauba Corp': 20, 'Technovatrix': 20, 'Aligned Automation': '125', 'Linkites': '108', '2basetechnologies': '69', 'ADCI PNQ 13 SEZ': 20, 'Eli Lilly': '34914', 'Exeliq Consulting': '22', 'PepsiCo': '309000', 'AWS ProServe IN - Karnataka': 20, 'Aruba Networks': '7000', 'ZunRoof Tech': '40', 'ERM Group': '5500', 'Genpact': '96500', 'Thomson Reuters': '24000', 'Techlive': '37', 'Carlson Wagonlit Travel': '18000', 'Monotype': '600', 'Knight FinTech': '80', 'Prompt Softech': '126', 'GE Renewable Energy': '205000', 'FactSet Research Systems': '10892', 'Trane Technologies': '50000', 'EDGE Networks': '109', 'Augusta Infotech': '25', 'OptiSol': '185', 'Tavant Technologies': '2500', 'ITH Technologies': '200', 'Affinity Express': '20', 'Icertis': '1700', 'Zebra Technologies': '8800', 'CRED': '839', 'Applogic': '25', 'Mercedes-Benz Research and Development India...': '3500', 'Tookitaki': '65', 'Supro info Solution': '25', 'Aditya Birla Group': '140000', 'SMEcorner': '300', 'CDM Smith': '5000', 'xtLytics': '39', 'Siemens Healthineers India LLP': '66000', 'Zippin': '77', 'NOVIQUE HEALTH': '25', 'NeenOpal': '30', 'WSD Consultant': '25', 'HSBC': '226059', 'Caterpillar': '97300', 'Axslogic': '26', 'ServiceNow': '15000', 'Perfios': '436', 'TheMathCompany': '867', 'Alpha ICT LLP': '25', 'Happymonk Technology': '20', 'Randstad': '38820', 'TIGI HR SOLUTION': '30', 'Deutsche Bank': '294', 'Weatherford': '17200', 'Helius Technologies': '183', 'D Cube Analytics': '188', 'BigTapp': '40', 'Prevalent AI': '600', 'NSEIT': '531', 'GlobalLogic': '2500', 'MSCI Inc': '40000', 'Infosenseglobal': '250', 'FinAcPlus': '139', 'RGF Professional Recruitment': '150', 'Radware Bot Manager': '1000', 'IDfy': '297', 'Turbolab Technologies': '51', 'Sequretek': '400', 'HighRadius': '1949', 'Ruby Seven Studios': '105', 'KlearNow': '10', 'Talentica Software India': '519', 'Wolters Kluwer': '19200', 'ASSPL - Karnataka': '20', 'IQLECT': '19', 'Seagate Technology': '40000', 'Oi': '2500', "Assassin's Creed": 20, 'Vymo': '316', 'Talent Leads HR Solutions': 20, 'OakNorth Bank': '229', 'The Smart Cube': '813', 'Buckman': 20, 'Near': '260', 'Navit Software Solutions': '20', 'Payoda': '628', 'Tekolutions.ai': 20, 'Protocolzone': 20, 'Siemens Healthineers': '66000', 'Bajaj FinServ': '26969', 'Infognana IG Solution': '326', 'Alliance Recruitment Agency': 20, 'PNR Software Solutions': '124', 'Mojocare, Alpha Digital Health': 20, 'Juniper Networks': '9000', 'AutomationEdge': '223', 'Indicia Worldwide': '1000', 'BluePi Consulting Pvt Ltd.': '70', 'Cardinal Health': '48000', 'Amrita University': '21', 'Business Brio': '20', 'Anlage Infotech': '109', 'Commvault': '2671', 'Emerging India Group': '20', 'ARi': '2298', 'Appriffy-Digital IT Hub': '50', 'VN SoftSol': '20', 'Foghorn Systems': '83', 'e-con Systems': '297', 'QuEST Global Engineering': '11250', 'UiPath': '3000', 'Danfoss': '37000', 'GridEdge Technologies': '20', 'EATON': '85000', 'Mind Works Global': '85', 'Squalas': '10', 'scaleorg': '25', 'Michael Page': '6750', 'ViaSat': '5800', 'Aera Technology': '465', 'Pype': '95', 'itForte': '25', 'Carrier': '56000', 'Germane Analytics Pvt Ltd': '25', 'XoriantË\x90IN': '3000', 'DTCC': '4300', 'Talent Corner HR Services Pvt. Ltd.': '77', 'Labcorp': '72400', 'Sigmoid, Bengaluru': '425', 'Pathfinder Business Analysis': '321', 'Camsdata': '200', 'MNF MyNextFilm': '30', 'M&G plc': '6000', 'Wissen Technology': '746', 'CrossML': '50', 'CoreStack': '147', 'Accrete.AI': '82', 'GE Corporate': '168000', 'KPMG': '236000', 'iMerit': '2894', 'Jubna': '8'}

In [ ]:
Revenuee = []
No_of_employee = []
for i in data['Company Name']:
        Revenuee.append(d.get(i))
        No_of_employee.append(e.get(i))

In [ ]:
len(Revenue)

1970

In [ ]:
data['Revenue'] = Revenuee
data['No of employee'] = No_of_employee

In [ ]:
data.head()

,Company Name,Location,Job Title,Description,JOB,Location.1,State,Python,SQL,R language,Linux,0,Cloud,Revenue,No of employee
0,Bosch Group,"Bengaluru, Karnataka",newData Scientist – AI / Deep Learning for Aut...,3.Most importantly – data aptitude..Looking at...,Data Scientist,Bengaluru,Karnataka,0,0,0,0,0,AWS,$77.721 B,31000
1,Standard Chartered,"Chennai, Tamil Nadu","newData Scientist, AIML",Manage a team dedicated for reviewing models r...,Data Scientist,Chennai,Tamil Nadu,1,0,0,1,0,AWS,$14.701 B,85000
2,Kaplan,"Bengaluru, Karnataka",newAssociate Data Scientist,Collaborate and help other data scientistsExtr...,Data Scientist,Bengaluru,Karnataka,1,0,0,0,0,AWS,$1.3 B,12000
3,Corteva Agriscience,"Hyderabad, Telangana",newAssociate Data Scientist,Leverage data science and data engineering res...,Data Scientist,Hyderabad,Telangana,1,0,0,1,0,AWS,$14.271 B,21000
4,UnitedHealth Group,"Bengaluru, Karnataka",Assc Data Scientist,4.Must have experience in working with end to ...,Data Scientist,Bengaluru,Karnataka,1,0,0,0,0,AWS,$285.1 B,300000

In [ ]:
data.columns

NameError: name 'data' is not defined

In [ ]:
data['0'].value_counts()

0    898
1     87
Name: 0, dtype: int64

In [ ]:
data.isnull().sum()

Company Name       0
Location           0
Job Title          0
Description        0
JOB                0
Location.1         0
State             91
Python             0
SQL                0
R language         0
Linux              0
0                  0
Cloud              0
Revenue            4
No of employee     4
dtype: int64

In [ ]:
data['Revenue'] = data['Revenue'].fillna(0.0005)

In [ ]:
data['No of employee'] = data['No of employee'].fillna(20)

In [ ]:
data.isnull().sum()

Company Name       0
Location           0
Job Title          0
Description        0
JOB                0
Location.1         0
State             91
Python             0
SQL                0
R language         0
Linux              0
0                  0
Cloud              0
Revenue            0
No of employee     0
dtype: int64

In [ ]:
data['State']= data['State'].fillna('Bengaluru')

In [ ]:
data.isnull().sum()

Company Name      0
Location          0
Job Title         0
Description       0
JOB               0
Location.1        0
State             0
Python            0
SQL               0
R language        0
Linux             0
0                 0
Cloud             0
Revenue           0
No of employee    0
dtype: int64

In [ ]:
data['Revenue'] = data['Revenue'].str.replace('$','')
data['Revenue'] = data['Revenue'].str.replace('B','')
data['Revenue'] = data['Revenue'].str.replace(' ','')
data['Revenue']

0      77.721
1      14.701
2         1.3
3      14.271
4       285.1
        ...
980     0.016
981      1.49
982    0.0005
983    119.54
984     14.46
Name: Revenue, Length: 985, dtype: object

In [ ]:
data.to_csv('Final_data.csv')

In [ ]:
df1 = pd.read_csv('Final_data.csv')

In [ ]:
df1.drop('Unnamed: 0',axis = 1,inplace = True)

In [ ]:
df1.columns

Index(['Company Name', 'Location', 'Job Title', 'Description', 'JOB',
       'Location.1', 'State', 'Python', 'SQL', 'R language', 'Linux', '0',
       'Cloud', 'Revenue', 'No of employee'],
      dtype='object')

In [ ]:
df1 = df1[['Company Name','Location.1','JOB','Python','SQL','R language','Linux','Cloud','0','Revenue','No of employee']]

In [ ]:
df1.head()

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,0,Revenue,No of employee
0,Bosch Group,Bengaluru,Data Scientist,0,0,0,0,AWS,0,77.721,31000
1,Standard Chartered,Chennai,Data Scientist,1,0,0,1,AWS,0,14.701,85000
2,Kaplan,Bengaluru,Data Scientist,1,0,0,0,AWS,0,1.3,12000
3,Corteva Agriscience,Hyderabad,Data Scientist,1,0,0,1,AWS,0,14.271,21000
4,UnitedHealth Group,Bengaluru,Data Scientist,1,0,0,0,AWS,0,285.1,300000

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 985 entries, 0 to 984
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company Name    985 non-null    object
 1   Location.1      985 non-null    object
 2   JOB             985 non-null    object
 3   Python          985 non-null    int64
 4   SQL             985 non-null    int64
 5   R language      985 non-null    int64
 6   Linux           985 non-null    int64
 7   Cloud           985 non-null    object
 8   0               985 non-null    int64
 9   Revenue         981 non-null    object
 10  No of employee  985 non-null    object
dtypes: int64(5), object(6)
memory usage: 84.8+ KB

In [ ]:
df1.isnull().sum()

Company Name      0
Location.1        0
JOB               0
Python            0
SQL               0
R language        0
Linux             0
Cloud             0
0                 0
Revenue           4
No of employee    0
dtype: int64

In [ ]:
df1.Revenue = df1.Revenue.fillna(0.0005)

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 985 entries, 0 to 984
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company Name    985 non-null    object
 1   Location.1      985 non-null    object
 2   JOB             985 non-null    object
 3   Python          985 non-null    int64
 4   SQL             985 non-null    int64
 5   R language      985 non-null    int64
 6   Linux           985 non-null    int64
 7   Cloud           985 non-null    object
 8   0               985 non-null    int64
 9   Revenue         985 non-null    object
 10  No of employee  985 non-null    object
dtypes: int64(5), object(6)
memory usage: 84.8+ KB

In [ ]:
df1.Revenue = df1.Revenue.str.replace(',','.')
df1['No of employee'] = df1['No of employee'].str.replace(',','.')
df1['No of employee'] = df1['No of employee'].str.replace('.','')

C:\Users\NIhar\AppData\Local\Temp/ipykernel_9400/2579849008.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df1['No of employee'] = df1['No of employee'].str.replace('.','')

In [ ]:
df1['Tablue'] = df1['0']

In [ ]:
df1.Revenue =pd.to_numeric(df1.Revenue)
df1['No of employee'] =pd.to_numeric( df1['No of employee'])

In [ ]:
df1.Cloud.unique()

array(['AWS', 'Azure', 'Both or Didnt Specift'], dtype=object)

In [ ]:
s = {'AWS' : 0 , 'Azure' : 1, 'Both or Didnt Specift' : 2}
df1['Cloud'] = df1['Cloud'].map(s)

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 985 entries, 0 to 984
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company Name    985 non-null    object
 1   Location.1      985 non-null    object
 2   JOB             985 non-null    object
 3   Python          985 non-null    int64
 4   SQL             985 non-null    int64
 5   R language      985 non-null    int64
 6   Linux           985 non-null    int64
 7   Cloud           985 non-null    int64
 8   0               985 non-null    int64
 9   Revenue         981 non-null    float64
 10  No of employee  985 non-null    int64
 11  Tablue          985 non-null    int64
dtypes: float64(1), int64(8), object(3)
memory usage: 92.5+ KB

In [ ]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [ ]:
df1['JOB']= le.fit_transform(df1['JOB'])
df1['Location.1'] = le.fit_transform(df1['Location.1'])

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 985 entries, 0 to 984
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company Name    985 non-null    object
 1   Location.1      985 non-null    int32
 2   JOB             985 non-null    int32
 3   Python          985 non-null    int64
 4   SQL             985 non-null    int64
 5   R language      985 non-null    int64
 6   Linux           985 non-null    int64
 7   Cloud           985 non-null    int64
 8   0               985 non-null    int64
 9   Revenue         981 non-null    float64
 10  No of employee  985 non-null    int64
 11  Tablue          985 non-null    int64
dtypes: float64(1), int32(2), int64(8), object(1)
memory usage: 84.8+ KB

In [ ]:
df1.Revenue = df1.Revenue.fillna(0.0005)

In [ ]:
df1.drop('0',axis = 1,inplace = True)

In [ ]:
df1.head()

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,Revenue,No of employee,Tablue
0,Bosch Group,8,27,0,0,0,0,0,77.721,31000,0
1,Standard Chartered,11,27,1,0,0,1,0,14.701,85000,0
2,Kaplan,8,27,1,0,0,0,0,1.300,12000,0
3,Corteva Agriscience,18,27,1,0,0,1,0,14.271,21000,0
4,UnitedHealth Group,8,27,1,0,0,0,0,285.100,300000,0

In [ ]:
X = df1.iloc[: , 1 :]

In [ ]:
X.isnull().sum()

Location.1        0
JOB               0
Python            0
SQL               0
R language        0
Linux             0
Cloud             0
Revenue           0
No of employee    0
Tablue            0
dtype: int64

In [ ]:
from sklearn.cluster import KMeans
kmeans = KMeans(n_clusters=5, random_state=42,algorithm='elkan',init='k-means++').fit(X)

In [ ]:
df1['Clusters'] = kmeans.labels_

In [ ]:
df2 = pd.read_csv('Final_data.csv')

In [ ]:
df2 = df2[['Company Name','Location.1','JOB','Python','SQL','R language','Linux','Cloud','0','Revenue','No of employee']]
df2['Tablue'] = df2['0']
df2.drop('0',axis = 1,inplace = True)

In [ ]:
df2['Clusters'] = kmeans.labels_

In [ ]:
df2.head()

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,Revenue,No of employee,Tablue,Clusters
0,Bosch Group,Bengaluru,Data Scientist,0,0,0,0,AWS,77.721,31000,0,2
1,Standard Chartered,Chennai,Data Scientist,1,0,0,1,AWS,14.701,85000,0,4
2,Kaplan,Bengaluru,Data Scientist,1,0,0,0,AWS,1.3,12000,0,2
3,Corteva Agriscience,Hyderabad,Data Scientist,1,0,0,1,AWS,14.271,21000,0,2
4,UnitedHealth Group,Bengaluru,Data Scientist,1,0,0,0,AWS,285.1,300000,0,3

In [ ]:
Cluster1 = df2[df2['Clusters'] == 0]
Cluster2 = df2[df2['Clusters'] == 1]
Cluster3 = df2[df2['Clusters'] == 2]
Cluster4 = df2[df2['Clusters'] == 3]
Cluster5 = df2[df2['Clusters'] == 4]

In [ ]:
Cluster1

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,Revenue,No of employee,Tablue,Clusters
29,Unilever,Bengaluru,Data Scientist,1,0,0,0,AWS,52.444,149000,0,0
35,Oracle,India,Data Scientist,0,0,0,0,AWS,40.47,132000,0,0
38,Unilever,Bengaluru,Data Scientist,1,0,0,0,AWS,52.444,149000,0,0
53,Intel,Bengaluru,Software Engineer,0,0,0,0,AWS,79.02,121100,0,0
77,Apple,Bengaluru,ML Engineer,0,1,1,1,Azure,365.82,"1,54,000",0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
919,Unilever,Bengaluru,Data Scientist,1,1,0,0,AWS,52.444,149000,0,0
942,Oracle,Bengaluru,Data Scientist,1,0,0,0,AWS,40.47,132000,0,0
968,ZF,Hyderabad,ML Engineer,1,0,0,0,Azure,41.45,147797,0,0
972,GE Corporate,Bengaluru,ML Engineer,1,0,0,0,Azure,74.196,168000,0,0
976,GE Corporate,Bengaluru,ML Engineer,0,0,0,1,Azure,74.196,168000,0,0

In [ ]:
Cluster2

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,Revenue,No of employee,Tablue,Clusters
143,PubMatic,Delhi,ML Engineer,0,0,0,1,Azure,0.005,57427.22,0,1
310,PubMatic,Delhi,ML Engineer,0,1,1,0,AWS,0.005,57427.22,0,1

In [ ]:
Cluster3

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,Revenue,No of employee,Tablue,Clusters
0,Bosch Group,Bengaluru,Data Scientist,0,0,0,0,AWS,77.721,31000,0,2
2,Kaplan,Bengaluru,Data Scientist,1,0,0,0,AWS,1.3,12000,0,2
3,Corteva Agriscience,Hyderabad,Data Scientist,1,0,0,1,AWS,14.271,21000,0,2
8,3SC Solutions,India,Data Scientist,1,0,0,0,AWS,0.055,221,0,2
9,Orange Business Services,India,Data Scientist,1,1,0,1,AWS,8.41,21000,0,2
...,...,...,...,...,...,...,...,...,...,...,...,...
977,General Mills,Remote in Mumbai,Data Scientist,1,1,0,1,AWS,18,33600,0,2
978,iMerit,India,ML Engineer,0,1,0,0,Azure,0.0235,2894,0,2
980,Jubna,Noida,Data Scientist,0,1,0,0,AWS,0.016,8,0,2
981,FactSet Research Systems,Hyderabad,ML Engineer,0,1,1,0,Azure,1.49,10892,0,2
982,Mount Talent Consulting,Gurgaon,Data Scientist,0,0,1,0,AWS,0.0005,20,0,2

In [ ]:
Cluster4

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,Revenue,No of employee,Tablue,Clusters
4,UnitedHealth Group,Bengaluru,Data Scientist,1,0,0,0,AWS,285.1,300000,0,3
6,Deloitte,Bengaluru,Data Scientist,1,0,0,1,AWS,50.2,334800,0,3
7,"JPMorgan Chase Bank, N.A.",Bengaluru,Data Scientist,1,0,0,1,AWS,119.54,256105,0,3
18,"JPMorgan Chase Bank, N.A.",Bengaluru,Data Scientist,0,0,0,0,AWS,119.54,256105,0,3
25,Deloitte,Bengaluru,Data Scientist,1,1,1,0,AWS,50.2,334800,0,3
...,...,...,...,...,...,...,...,...,...,...,...,...
951,Deloitte,Bengaluru,Assistant Manager - AI Systems Data Architect ...,1,1,0,0,AWS,50.2,334800,0,3
956,Siemens,Pune,ML Engineer,0,0,0,0,Azure,70.67,303000,0,3
964,"JPMorgan Chase Bank, N.A.",Mumbai,newQR - Wholesale Credit Risk - Associate,1,0,0,1,Both or Didnt Specift,119.54,256105,0,3
974,KPMG,Mumbai,Consultant,1,0,0,1,Both or Didnt Specift,14.3,236000,0,3
983,"JPMorgan Chase Bank, N.A.",Mumbai,Analytics,0,0,0,0,AWS,119.54,256105,1,3

In [ ]:
Cluster5

,Company Name,Location.1,JOB,Python,SQL,R language,Linux,Cloud,Revenue,No of employee,Tablue,Clusters
1,Standard Chartered,Chennai,Data Scientist,1,0,0,1,AWS,14.701,85000,0,4
5,HP,Bengaluru,Data Scientist,1,1,0,0,AWS,56.64,53000,0,4
10,Maersk,Pune,Data Scientist,0,0,0,1,AWS,39,83000,0,4
27,Kyndryl,India,Data Scientist,0,1,0,0,AWS,18.6,90000,0,4
28,Ecolab,Bengaluru,Data Scientist,0,1,0,0,AWS,14.9,50000,0,4
...,...,...,...,...,...,...,...,...,...,...,...,...
967,Maersk,Pune,Analytics,1,1,1,1,AWS,39,83000,1,4
971,IQVIA,Bengaluru,Analytics,0,0,0,1,AWS,3.298,77000,1,4
973,Novartis,Hyderabad,Analytics,0,0,0,1,Azure,49.89,104323,1,4
979,IQVIA,Bengaluru,Senior Statistical Programmer,1,0,0,1,Azure,3.298,77000,0,4
984,Siemens Healthineers,Bengaluru,Data Integration Specialist,0,0,0,1,Both or Didnt Specift,14.46,66000,0,4